tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"

cask_args appdir: "/Applications"

brew "act"
brew "bat"
brew "curl"
brew "eza"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "jq"
brew "mas"
brew "minikube"
brew "mise"
brew "mysql"
brew "neovim"
brew "postgresql"
brew "ripgrep"
brew "rsync"
brew "tfsec"
brew "tree"
brew "vim"
brew "wget"
brew "yq"
brew "zoxide"

cask "1password"
cask "alt-tab"
cask "battle-net"
cask "brave-browser"
cask "deepl"
cask "discord"
cask "docker"
cask "drawio"
cask "figma"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-japanese-ime"
cask "hstracker"
cask "jetbrains-toolbox"
cask "logi-options-plus"
cask "logitech-options"
cask "logitune"
cask "notion"
cask "obs"
cask "postman"
cask "raycast"
cask "slack"
cask "stoplight-studio"
cask "utm"
cask "visual-studio-code"
cask "warp"
cask "zoom"

mas "Spark", id: 1176895641
mas "LINE", id: 539883307
mas "Kindle", id: 302584613
