bierner.emojisense
bierner.markdown-emoji
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
GitHub.github-vscode-theme
GitHub.vscode-pull-request-github
golang.go
humao.rest-client
ipatalas.vscode-postfix-ts
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vsliveshare.vsliveshare
naumovs.color-highlight
negokaz.zenn-editor
oderwat.indent-rainbow
PKief.material-icon-theme
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
steoates.autoimport
streetsidesoftware.code-spell-checker
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
