asvetliakov.vscode-neovim
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
esbenp.prettier-vscode
GitHub.github-vscode-theme
golang.go
Gruntfuggly.todo-tree
kddejong.vscode-cfn-lint
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-vscode-remote.remote-containers
ms-vsliveshare.vsliveshare
PKief.material-icon-theme
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
VisualStudioExptTeam.vscodeintellicode
